In [1]:
# pandas (paneldata)1.Series 2.Data Frame 3.panel

In [6]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [7]:
# creation of series from scaler values

In [8]:
import pandas as pd

In [2]:
series1=pd.Series([10,20,30])
print(series1)

0    10
1    20
2    30
dtype: int64

In [15]:
series2=pd.Series(['a','b','c','d'],index=[1,2,3,4])
print(series2)

1    a
2    b
3    c
4    d
dtype: object

In [18]:
series3=pd.Series(["a","b","c"],index=[1,2,3,])
print(series3)

1    a
2    b
3    c
dtype: object

In [19]:
# creation series from numpy array

In [21]:
!pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\programdata\anaconda3\lib\site-packages (1.24.3)

In [2]:
import numpy as np

In [24]:
arr1=np.array([1,2,3,4,5])
print(arr1)

[1 2 3 4 5]

In [25]:
series4=pd.Series(arr1)
print(series4)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [31]:
series5=pd.Series(arr1,index=['a','b','c','d','e'])
print(series5)

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [32]:
# creation of series from dictonary

In [35]:
dict1={'india':'new delhi','uk':'london','japan':'tokyo'}
print(dic1)

{'india': 'new delhi', 'uk': 'london', 'japan': 'tokyo'}

In [52]:
series6=pd.Series(dict1)
print(series6)

india    new delhi
uk          london
japan        tokyo
dtype: object

In [37]:
series6=pd.Series(dict1,index=[1,2,3])
print(series6)

1    NaN
2    NaN
3    NaN
dtype: object

In [38]:
# accessing element from series

In [40]:
print(series1[2])

30

In [41]:
print(series2[2])

b

In [45]:
print(series1[[1,2]])

1    20
2    30
dtype: int64

In [53]:
print(series6['uk'])

london

In [55]:
print(series2[1:3])

2    b
3    c
dtype: object

In [57]:
print(series2[::-1])

4    d
3    c
2    b
1    a
dtype: object

In [59]:
series7=pd.Series(np.arange(10,16,1),index=['a','b','c','d','e','f'])
print(series7)

a    10
b    11
c    12
d    13
e    14
f    15
dtype: int32

In [63]:
series7[1:3]=50
print(series7)

a    10
b    50
c    50
d    13
e    14
f    15
dtype: int32

In [64]:
series7[1:3]=50,60
print(series7)

a    10
b    50
c    60
d    13
e    14
f    15
dtype: int32

In [76]:
series7['c':'e']=70,80,90
print(series7)

a    10
b    50
c    70
d    80
e    90
f    15
dtype: int32

In [4]:
series8=pd.Series(np.arange(10,20,1))
print(series8)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [5]:
series8.head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [7]:
series8.head(2)

0    10
1    11
dtype: int32

In [11]:
series8.count()

10

In [13]:
series8.tail()

5    15
6    16
7    17
8    18
9    19
dtype: int32

In [14]:
series8.tail(2)

8    18
9    19
dtype: int32

In [15]:
# mathematical opration on series
seriesa=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(seriesa)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
seriesb=pd.Series([10,20,-10,-50,-100],index=['y','z','a','c','e'])
print(seriesb)

y     10
z     20
a    -10
c    -50
e   -100
dtype: int64

In [18]:
a=seriesa+seriesb
print(a)

a    -9.0
b     NaN
c   -47.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [20]:
b=seriesa-seriesb
print(b)

a     11.0
b      NaN
c     53.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [21]:
c=seriesa*seriesb
print(c)

a    -10.0
b      NaN
c   -150.0
d      NaN
e   -500.0
y      NaN
z      NaN
dtype: float64

In [22]:
d=seriesa/seriesb
print(d)

a   -0.10
b     NaN
c   -0.06
d     NaN
e   -0.05
y     NaN
z     NaN
dtype: float64

In [23]:
e=seriesa//seriesb
print(e)

a   -1.0
b    NaN
c   -1.0
d    NaN
e   -1.0
y    NaN
z    NaN
dtype: float64

In [24]:
f=seriesa%seriesb
print(f)

a    -9.0
b     NaN
c   -47.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [25]:
#2.data frame :- a data frame is two dimensional leved data structure like a table of my sql. it contain rows and column and
#therefor has both row and column index

In [29]:
#creation of DataFrame
data1={"calories":[10,20,30],"duration":[50,40,45]}
df=pd.DataFrame(data1)
print(df)

   calories  duration
0        10        50
1        20        40
2        30        45

In [30]:
df=pd.DataFrame(data1,index=['day1','day2','day3'])
print(df)

      calories  duration
day1        10        50
day2        20        40
day3        30        45

In [31]:
#creation of dataframe from numpy ndarray

In [33]:
arr1=np.array([10,20,30])
arr2=np.array([100,200,300])
arr3=np.array([-10,-20,-30,-40])
df=pd.DataFrame([arr1,arr2,arr3],columns=['a','b','c','d'])
print(df)

     a    b    c     d
0   10   20   30   NaN
1  100  200  300   NaN
2  -10  -20  -30 -40.0

In [34]:
arr1=np.array([10,20,30,":"])
arr2=np.array([100,200,300,"a"])
arr3=np.array([-10,-20,-30,-40])
df=pd.DataFrame([arr1,arr2,arr3],columns=['a','b','c','d'])
print(df)

     a    b    c    d
0   10   20   30    :
1  100  200  300    a
2  -10  -20  -30  -40

In [35]:
# creation of dataframe from list of dictonary

In [5]:
list_dict=[{'a':10,'b':20},{'a':5,'b':10,'c':15}]
df1=pd.DataFrame(list_dict,index=["day1","day2"])
print(df1)

       a   b     c
day1  10  20   NaN
day2   5  10  15.0

In [4]:
#opreation on row and columns in DF
#1. add a new column to df

In [26]:
result_sheet={"smith":pd.Series([90,91,92],index=["maths","science","english"]),
              "tony":pd.Series([92,81,86],index=["maths","science","english"]),
              "jack":pd.Series([81,71,72],index=["maths","science","english"])}
rdf=pd.DataFrame(result_sheet)
print(rdf)

         smith  tony  jack
maths       90    92    81
science     91    81    71
english     92    86    72

In [5]:
rdf["rahul"]=[90,98,99]
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     90
science     91    81    71     98
english     92    86    72     99

In [6]:
rdf["rahul"]=[60,61,63]
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     60
science     91    81    71     61
english     92    86    72     63

In [7]:
rdf["rahul"]=85
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     85
science     91    81    71     85
english     92    86    72     85

In [8]:
# add a new row in dataframe

In [9]:
rdf.loc["hindi"]=[80,60,70,90]
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     85
science     91    81    71     85
english     92    86    72     85
hindi       80    60    70     90

In [10]:
rdf.loc["english"]=70
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     85
science     91    81    71     85
english     70    70    70     70
hindi       80    60    70     90

In [11]:
#deletion of row or column from dataframe

In [12]:
# deletion of row and column from a dataframe. we can use datafram.drop method to delete row and column from dataframe.
#to delete a row the parameter axis is assigned the value 0 and for deleting a column the paramter axis is assigned the value 1

In [13]:
# for row deletion
rdf=rdf.drop('science',axis=0)
print(rdf)

         smith  tony  jack  rahul
maths       90    92    81     85
english     70    70    70     70
hindi       80    60    70     90

In [14]:
rdf=rdf.drop('rahul',axis=1)
print(rdf)

         smith  tony  jack
maths       90    92    81
english     70    70    70
hindi       80    60    70

In [15]:
# rename row label of a data frame
rdf=rdf.rename({"maths":"subject1","english":"subject2","hindi":"subject3"},axis='index')
print(rdf)

          smith  tony  jack
subject1     90    92    81
subject2     70    70    70
subject3     80    60    70

##

In [16]:
rdf=rdf.rename({"smith":"student1","tony":"student2","jack":"student3"},axis="columns")
print(rdf)

          student1  student2  student3
subject1        90        92        81
subject2        70        70        70
subject3        80        60        70

In [17]:
#accesing dataframe elements threw indexing
# label based indexing
rdf=rdf.loc["subject1"]
print(rdf)

student1    90
student2    92
student3    81
Name: subject1, dtype: int64

In [23]:
print(rdf)

student1    90
student2    92
student3    81
Name: subject1, dtype: int64

In [35]:
#ACCESING DATAFRAME ELEMENTS TREW SLICING
rdf.loc["maths":"english"]

         smith  tony  jack
maths       90    92    81
science     91    81    71
english     92    86    72

In [34]:
rdf.loc['maths':'english',['smith','tony']]

         smith  tony
maths       90    92
science     91    81
english     92    86

In [45]:
#joining merging and concatination of dataframes
dframe1=pd.DataFrame([[1,2,3],[4,5],[6]],columns=['c1','c2','c3'],index=['r1','r2','r3'])
print(dframe1)

    c1   c2   c3
r1   1  2.0  3.0
r2   4  5.0  NaN
r3   6  NaN  NaN

In [46]:
dframe2=pd.DataFrame([[10,20],[30],[40,50]],columns=['c2','c5'],index=['r4','r2','r5'])
print(dframe2)

    c2    c5
r4  10  20.0
r2  30   NaN
r5  40  50.0

In [47]:
dframe1=dframe1._append(dframe2)
print(dframe1)

     c1    c2   c3    c5
r1  1.0   2.0  3.0   NaN
r2  4.0   5.0  NaN   NaN
r3  6.0   NaN  NaN   NaN
r4  NaN  10.0  NaN  20.0
r2  NaN  30.0  NaN   NaN
r5  NaN  40.0  NaN  50.0

In [48]:
dframe2=dframe2._append(dframe1)
print(dframe2)

      c2    c5   c1   c3
r4  10.0  20.0  NaN  NaN
r2  30.0   NaN  NaN  NaN
r5  40.0  50.0  NaN  NaN
r1   2.0   NaN  1.0  3.0
r2   5.0   NaN  4.0  NaN
r3   NaN   NaN  6.0  NaN
r4  10.0  20.0  NaN  NaN
r2  30.0   NaN  NaN  NaN
r5  40.0  50.0  NaN  NaN

In [49]:
#attributes of dataframe
result_sheet={"smith":pd.Series([90,91,92],index=["maths","science","english"]),
              "tony":pd.Series([92,81,86],index=["maths","science","english"]),
              "jack":pd.Series([81,71,72],index=["maths","science","english"])}
rdf=pd.DataFrame(result_sheet)
print(rdf)

         smith  tony  jack
maths       90    92    81
science     91    81    71
english     92    86    72

In [50]:
# to display row label
rdf.index

Index(['maths', 'science', 'english'], dtype='object')

In [51]:
# to display columns label
rdf.columns

Index(['smith', 'tony', 'jack'], dtype='object')

In [53]:
# to diplay datatype of each column
rdf.dtypes

smith    int64
tony     int64
jack     int64
dtype: object

In [54]:
# to display dimention of datafram
rdf.shape

(3, 3)

In [56]:
# to display total values of dataframe
rdf.size

9

In [58]:
# to display n number of row from above data frame
rdf.head(2)

         smith  tony  jack
maths       90    92    81
science     91    81    71

In [59]:
# to display n number of row from below data frame
rdf.tail(2)

         smith  tony  jack
science     91    81    71
english     92    86    72